Repository: Nakashun-mf/KeyAutomator
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# AppDescription
source: Register keyboard macros and send them to the active window after a delay.
ja_jp: キー入力マクロを登録し、アクティブウィンドウへ自動入力するデスクトップアプリ

# AppTitleBar.Subtitle
source: Keyboard macros
ja_jp: キー入力マクロ

# LanguageLabel.Text
source: Language
ja_jp: 言語

# LanguageBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Display language
ja_jp: 表示言語

# Language_System
source: Match Windows
ja_jp: Windows に合わせる

# MacroListHeading.Text
source: Macros
ja_jp: マクロ一覧

# MacroListHint.Text
source: Select to edit on the right / Ctrl+Shift to multi-select / drag to reorder
ja_jp: 選ぶと右で編集 / Ctrl・Shiftで複数選択 / ドラッグで並べ替え

# MacroList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Macro list
ja_jp: マクロ一覧

# MacroList.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Ctrl / Shift to multi-select. Drag to reorder.
ja_jp: Ctrl / Shift で複数選択。ドラッグで並べ替えできます

# NewMacroButton.Content
source: New
ja_jp: 新規

# NewMacroButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: New macro
ja_jp: 新規作成

# LoadSampleButton.Content
source: Samples
ja_jp: サンプル

# LoadSampleButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Load sample macros
ja_jp: サンプルマクロを読み込む

# LoadSampleButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Load sample macros
ja_jp: サンプルマクロを読み込みます

# CloneButton.Content
source: Duplicate
ja_jp: 複製

# CloneButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Duplicate
ja_jp: 複製

# DeleteMacroButton.Content
source: Delete
ja_jp: 削除

# DeleteMacroButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Delete
ja_jp: 削除

# EmptyTitle.Text
source: Select a macro
ja_jp: マクロを選んでください

# EmptyHint.Text
source: Pick one from the list on the left, or choose New. First time here? Try the samples.
ja_jp: 左の一覧から選ぶか、「新規」で作成します。はじめてならサンプルから試せます。

# EmptyNewButton.Content
source: New
ja_jp: 新規

# EmptyNewButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: New macro
ja_jp: 新規マクロ

# EmptyLoadSampleButton.Content
source: Load samples
ja_jp: サンプルを読み込む

source: Load sample macros
ja_jp: サンプルマクロを読み込む

# EmptyLoadSampleButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Loads a login example and a copy example (asks first if macros already exist).
ja_jp: ログイン例とコピー例を読み込みます（既存がある場合は確認します）

# EmptyTestHint.Text
source: Switch to the target window before running a test
ja_jp: テスト実行の前に、入力先ウィンドウへ切り替えてください

# EditHeading.Text
source: Edit
ja_jp: 編集

# EditIdBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Macro ID
ja_jp: マクロID

# LabelName.Text
source: Name
ja_jp: 名前

# EditNameBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Macro name
ja_jp: マクロ名

# EditNameBox.PlaceholderText
source: Display name
ja_jp: 表示名

# LabelDelay.Text
source: Start after
ja_jp: 開始まで

# LabelDelay.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Seconds to wait after Test or CLI start before typing. Switch to the target window during this time.
ja_jp: テスト実行・CLI実行のあと、入力が始まるまでの秒数。このあいだに入力先ウィンドウへ切り替えてください

# EditDelayBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Seconds before start
ja_jp: 開始までの秒数

# EditDelayBox.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Seconds before start. Switch to the target window during this time.
ja_jp: 開始までの秒数。このあいだに入力先ウィンドウへ切り替えてください

# SecondsLabel.Text
source: sec
ja_jp: 秒

# LabelAlias.Text
source: Alias
ja_jp: 引数名

# LabelAlias.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Optional. For CLI. Letters, digits, and _ only. Example: login_ok. Copy Launch path copies the path and argument together.
ja_jp: 任意。CLI用です。空でOK。英数字と _ のみ。例: login_ok。選んでいるマクロは下の「起動パスをコピー」でパスと引数をまとめてコピーできます

# EditAliasBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: CLI alias (optional)
ja_jp: 引数名エイリアス（任意）

# EditAliasBox.PlaceholderText
source: Optional (CLI; can be empty)
ja_jp: 任意（CLI用・空でOK）

# EditAliasBox.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Can be empty. Copy Launch path copies path plus -alias (or -id). Use -alias login_ok only when you need it.
ja_jp: 空でも保存できます。選んでいるマクロは下の「起動パスをコピー」でパスと引数をまとめてコピー。使う場合のみ: -alias login_ok

# ActionsHeading.Text
source: Steps
ja_jp: 実行手順

# AddTextButton.Content
source: Text
ja_jp: テキスト

# AddTextButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add text
ja_jp: テキスト追加

# AddKeyButton.Content
source: Key
ja_jp: キー

# AddKeyButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add special key
ja_jp: 特殊キー追加

# AddHotkeyButton.Content
source: Shortcut
ja_jp: ショートカット

# AddHotkeyButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add shortcut
ja_jp: ショートカット追加

# AddMouseButton.Content
source: Mouse
ja_jp: マウス

# AddMouseButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add mouse click
ja_jp: マウスクリック追加

# AddWaitButton.Content
source: Wait
ja_jp: 待つ

# AddWaitButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add wait
ja_jp: ウェイト追加

# AddDialogButton.Content
source: Confirm
ja_jp: 確認

# AddDialogButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Add confirmation dialog
ja_jp: 確認ダイアログ追加

# AddDialogButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Shows a message and continues after OK
ja_jp: メッセージを表示し、OK で次へ進む

# WrapRepeatButton.Content
source: Repeat
ja_jp: 繰り返し

# WrapRepeatButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Wrap in repeat
ja_jp: 繰り返しで囲む

# WrapRepeatButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Wrap selected steps in a repeat block (inserts an empty block if nothing is selected)
ja_jp: 選択した手順を繰り返しブロックで囲みます（未選択なら空ブロックを挿入）

# MoveUpButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Move up
ja_jp: 上へ

# MoveUpButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Move up
ja_jp: 上へ

# MoveDownButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Move down
ja_jp: 下へ

# MoveDownButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Move down
ja_jp: 下へ

# RemoveActionButton.Content
source: Delete
ja_jp: 削除

# RemoveActionButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Delete action
ja_jp: アクション削除

# ColType.Text
source: Type
ja_jp: 種類

# ColValue.Text
source: Details
ja_jp: 内容

# ActionList.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Action list
ja_jp: アクション一覧

# ActionList.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Ctrl / Shift to multi-select. Drag to reorder steps.
ja_jp: Ctrl / Shift で複数選択。ドラッグで手順を並べ替えできます

# ActionTypeBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Action type
ja_jp: アクション種別

# SpecialKeyBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Special key
ja_jp: 特殊キー選択

# MouseActionBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Mouse action
ja_jp: マウス操作選択

# HotkeyPartBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Chord key
ja_jp: 同時押しキー

source: Remove key
ja_jp: キーを外す

# RemoveHotkeyPartButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove this key
ja_jp: このキーを外す

source: Add key
ja_jp: キーを追加

# AddHotkeyPartButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Add a key to the chord
ja_jp: 同時押しするキーを追加

# RepeatCountBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Repeat count
ja_jp: 繰り返し回数

# RepeatTimesLabel.Text
source: times
ja_jp: 回くりかえす

# EndRepeatLabel.Text
source: ──────── end ────────
ja_jp: ──────── ここまで ────────

# EndRepeatLabel.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: End of repeat
ja_jp: 繰り返しここまで

# ActionValueBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Action value
ja_jp: アクション設定値

# SaveButton.Content
source: Save
ja_jp: 保存

# SaveButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Save
ja_jp: 保存

# DiscardButton.Content
source: Discard
ja_jp: 破棄

# DiscardButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Discard
ja_jp: 破棄

# TestButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Test run or stop
ja_jp: テスト実行または中断

# TestButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Switch to the target window during the start delay. You can stop a run in progress.
ja_jp: 開始までの秒数のあいだに入力先ウィンドウへ切り替えてください。実行中は中断できます。

# OpenFolderButton.Content
source: Settings folder
ja_jp: 設定フォルダ

# OpenFolderButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Open settings folder
ja_jp: 設定フォルダを開く

# OpenFolderButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Opens the folder that contains config.json and error.log in File Explorer
ja_jp: config.json や error.log があるフォルダをエクスプローラーで開きます

# CopyLaunchPathButton.Content
source: Copy launch path
ja_jp: 起動パスをコピー

source: Copy CLI launch path
ja_jp: CLI起動用パスをコピー

source: With a macro selected, copies the path and argument together. With none selected, copies the path only. This is not the settings folder.
ja_jp: マクロを選んでいるときはパスと引数をまとめてコピーします。未選択ならパスだけです。設定フォルダとは別です。

# CopyLaunchPathButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: With a macro selected, copies “path -alias name” (or -id if the alias is empty). With none selected, copies the path only. Not the settings folder. MSIX / Store builds use the WindowsApps alias.
ja_jp: マクロを選んでいるときは「パス -alias 引数名」（引数名が空なら -id）をまとめてコピーします。未選択ならパスだけです。設定フォルダとは別です。MSIX / ストア版は WindowsApps のエイリアスです。

# ActionDelayLabel.Text
source: Step gap
ja_jp: 手順間隔

# ActionDelayBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Seconds between steps
ja_jp: 手順間隔秒

# ActionDelayBox.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Automatic wait inserted between steps (0 disables it)
ja_jp: 各手順のあいだに自動で挟む待機秒数（0 で無効）

# ConfirmDeleteLabel.Text
source: Confirm before delete
ja_jp: 削除前に確認

source: Confirm before delete
ja_jp: 削除前に確認

# ConfirmDeleteSwitch.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: When off, macros and steps are deleted without a confirmation prompt
ja_jp: オフにすると、マクロ／手順の削除確認を出さずに削除します

# ActionType_text
source: Type text
ja_jp: テキスト入力

# ActionHint_text
source: Types the string as-is (Japanese and symbols are fine)
ja_jp: 文字列をそのまま入力します（日本語・記号OK）

# ActionPlaceholder_text
source: Example: user_admin
ja_jp: 例: user_admin

# ActionType_key
source: Special key
ja_jp: 特殊キー

# ActionHint_key
source: Pick one key from the list
ja_jp: 一覧からキーを1つ選んでください

# ActionType_hotkey
source: Shortcut
ja_jp: ショートカット

# ActionHint_hotkey
source: Add keys to press together from the dropdowns
ja_jp: 同時押しするキーをプルダウンで追加してください

# ActionType_mouse
source: Mouse click
ja_jp: マウスクリック

# ActionHint_mouse
source: Clicks at the current pointer position (coordinates cannot be set)
ja_jp: いまマウスがある位置をクリックします（座標指定はできません）

# ActionType_wait
source: Wait
ja_jp: 待機

# ActionHint_wait
source: Waits before the next step (seconds; decimals allowed)
ja_jp: 次の操作まで待ちます（秒・小数可）

# ActionPlaceholder_wait
source: Example: 0.5
ja_jp: 例: 0.5

# ActionType_dialog
source: Confirmation dialog
ja_jp: 確認ダイアログ

# ActionHint_dialog
source: Shows a message and does not continue until you press OK
ja_jp: メッセージを表示し、OK を押すまで次へ進みません

# ActionPlaceholder_dialog
source: Example: Activate the target window, then press OK
ja_jp: 例: 入力先ウィンドウをアクティブにして OK

# ActionType_repeat
source: Repeat
ja_jp: 繰り返し

# ActionHint_repeat
source: Repeats the steps until End the given number of times (nesting allowed)
ja_jp: ここから「ここまで」までの手順を指定回数繰り返します（ネスト可）

# ActionPlaceholder_repeat
source: Example: 3
ja_jp: 例: 3

# ActionType_end_repeat
source: End
ja_jp: ここまで

# ActionHint_end_repeat
source: Marks the end of a repeat block
ja_jp: 繰り返しブロックの終わりです

# Mouse_LEFT
source: Left click
ja_jp: 左クリック

# Mouse_RIGHT
source: Right click
ja_jp: 右クリック

# Mouse_MIDDLE
source: Middle click
ja_jp: 中クリック

# Mouse_LEFT_DOUBLE
source: Left double-click
ja_jp: 左ダブルクリック

# Key_NumpadDigit
source: Numpad {0}
ja_jp: テンキー {0}

# Key_NumpadSymbol
source: Numpad {0}
ja_jp: テンキー {0}

# Macro_DelayLabel
source: Starts in {0} sec
ja_jp: 開始まで {0} 秒

# Macro_NoActions
source: No steps
ja_jp: 手順なし

# Macro_ActionCount
source: {0} steps
ja_jp: {0} 手順

# Macro_NoAlias
source: No CLI alias (optional)
ja_jp: CLI引数なし（任意）

# Macro_Alias
source: CLI alias: {0}
ja_jp: CLI引数: {0}

# Macro_DefaultName
source: New macro
ja_jp: 新しいマクロ

# Macro_CloneName
source: {0} (copy)
ja_jp: {0} (コピー)

# Error_AliasCharset
source: Aliases may only use letters, digits, and _
ja_jp: 引数名は英数字と _ のみ使えます

# Status_Ready
source: Ready
ja_jp: 準備完了

# Status_NoActions
source: No steps yet
ja_jp: 手順はまだありません

# Status_NoActionsHint
source: No steps yet. Add some with the buttons below.
ja_jp: 手順はまだありません。下のボタンから追加してください。

# Status_ActionSummary
source: Runs {0} steps from the top
ja_jp: 上から順に {0} 手順を実行します

# Status_ActionSummaryWithLoops
source: Runs {0} steps from the top ({1} repeats)
ja_jp: 上から順に {0} 手順（繰り返し {1}）を実行します

source: Test run
ja_jp: テスト実行

# Test_Stop
source: Stop
ja_jp: 中断

# Status_LoadedFallback
source: Loaded {0} macros ({1}; settings are in the user folder)
ja_jp: 読込完了: {0} 件（{1} ※設定はユーザーフォルダ側）

# Status_Loaded
source: Loaded {0} macros ({1})
ja_jp: 読込完了: {0} 件（{1}）

# Status_LoadFailed
source: Could not load settings ({0}). The damaged file was not overwritten{1}
ja_jp: 設定の読み込みに失敗しました（{0}）。破損ファイルは上書きしていません{1}

# Status_LoadFailedBackup
source: Could not load settings. Backup: {0}{1}
ja_jp: 設定の読み込みに失敗しました。バックアップ: {0}{1}

# Status_SampleMissing
source: Could not load sample macros
ja_jp: サンプルマクロを取得できませんでした

# Status_SampleLoaded
source: Loaded samples: {0} macros → {1}
ja_jp: サンプルを読み込みました: {0} 件 → {1}

# Status_Created
source: Created: ID {0}
ja_jp: 新規作成: ID {0}

# Status_Cloned
source: Duplicated: ID {0}
ja_jp: 複製: ID {0}

# Status_DeletedOne
source: Deleted: ID {0}
ja_jp: 削除: ID {0}

# Status_DeletedMany
source: Deleted: {0} macros
ja_jp: 削除: {0} 件

# Status_NameRequired
source: Enter a macro name
ja_jp: マクロ名を入力してください

# Status_IdMustBeInteger
source: ID must be a whole number
ja_jp: ID は整数で入力してください

# Status_IdMustBePositive
source: ID must be 1 or greater
ja_jp: ID は 1 以上にしてください

# Status_IdInUse
source: ID {0} is already in use
ja_jp: ID {0} は既に使用されています

# Status_AliasInUse
source: Alias "{0}" is already in use
ja_jp: 引数名「{0}」は既に使用されています

# Status_StepError
source: Step {0}: {1}
ja_jp: 手順 {0}: {1}

# Status_Saved
source: Saved → {0}
ja_jp: 保存しました → {0}

# Status_SavedWithAlias
source: Saved (args: -alias {0} / -{0}) → {1}
ja_jp: 保存しました（引数: -alias {0} / -{0}）→ {1}

# Status_Discarded
source: Edits discarded
ja_jp: 編集を破棄しました

# Status_EmptyRepeatInserted
source: Inserted an empty repeat block (add steps before End)
ja_jp: 空の繰り返しブロックを挿入しました（「ここまで」までのあいだに手順を入れてください）

# Status_WrappedRepeat
source: Wrapped steps {0}–{1} in a repeat (you can edit the count)
ja_jp: 手順 {0}〜{1} を繰り返しで囲みました（回数は編集できます）

# Status_MacroOrderSaved
source: Macro order saved
ja_jp: マクロの順序を保存しました

# Status_ActionOrderChanged
source: Step order changed (save to keep it)
ja_jp: 手順の順序を変更しました（保存で確定）

# Status_SaveFailed
source: Save failed: {0}{1}
ja_jp: 保存に失敗しました: {0}{1}

# Status_LogHint
source: (details: {0})
ja_jp: （詳細: {0}）

# Status_LogMissing
source: (could not write a log; move the exe to a writable folder)
ja_jp: （ログを書き込めませんでした。書き込み可能なフォルダへ exe を置き直してください）

# Status_FolderOpened
source: Opened settings folder: {0}
ja_jp: 設定フォルダを開きました: {0}

# Status_FolderOpenFailed
source: Could not open settings folder: {0}
ja_jp: 設定フォルダを開けませんでした: {0}

# Status_Copied
source: Copied: {0}
ja_jp: コピーしました: {0}

# Status_CopyFailed
source: Could not copy the launch path
ja_jp: 起動パスをコピーできませんでした

# Status_DeleteError
source: An error occurred while deleting
ja_jp: 削除中にエラーが発生しました

# Status_Stopping
source: Stopping…
ja_jp: 中断しています…

# Status_Running
source: Running… (Stop to cancel)
ja_jp: 実行中…（中断ボタンで停止）

# Status_RunStopped
source: Run stopped
ja_jp: 実行を中断しました

# Status_RunDone
source: Test run finished
ja_jp: テスト実行完了

# Status_RunErrorLog
source: Run error (details: {0})
ja_jp: 実行エラー（詳細: {0}）

# Status_RunErrorNoLog
source: Run error (could not write a log)
ja_jp: 実行エラー（ログを書き込めませんでした）

# Status_LanguageRestart
source: Language will apply after the window reloads
ja_jp: 言語を切り替えたのでウィンドウを再読み込みします

# Dialog_Delete
source: Delete
ja_jp: 削除

# Dialog_Cancel
source: Cancel
ja_jp: キャンセル

# Dialog_Save
source: Save
ja_jp: 保存

# Dialog_Discard
source: Discard
ja_jp: 破棄

# Dialog_Run
source: Run
ja_jp: 実行

# Dialog_Load
source: Load
ja_jp: 読み込む

# Dialog_UnsavedTitle
source: Unsaved changes
ja_jp: 未保存の変更

# Dialog_UnsavedBody
source: You have unsaved edits. What do you want to do?
ja_jp: 編集中の内容が保存されていません。どうしますか？

# Dialog_LoadSampleTitle
source: Load samples
ja_jp: サンプルを読み込む

# Dialog_LoadSampleBody
source: Replace the current macro list with {0} samples? Unsaved changes will be lost.
ja_jp: 現在のマクロ一覧をサンプル（{0}件）で置き換えます。よろしいですか？ （置き換え前に保存していない変更は失われます）

# Dialog_DeleteMacroTitle
source: Delete macros
ja_jp: マクロを削除

# Dialog_DeleteMacroOne
source: Delete ID {0} "{1}"?
ja_jp: ID {0}「{1}」を削除しますか？

# Dialog_DeleteMacroMany
source: Delete the {0} selected macros?
ja_jp: 選択した {0} 件のマクロを削除しますか？

# Dialog_DeleteActionTitle
source: Delete steps
ja_jp: 手順を削除

# Dialog_DeleteActionOne
source: Delete step {0} ({1})?
ja_jp: 手順 {0}（{1}）を削除しますか？

# Dialog_DeleteActionMany
source: Delete the {0} selected steps?
ja_jp: 選択した {0} 件の手順を削除しますか？

# Dialog_TestTitle
source: Test run
ja_jp: テスト実行

# Dialog_TestBody
source: Important: after you press Run, click the window you want to type into and bring it to the front during the countdown. Starts in: {0} sec If this app stays in front, input goes here. To send keys to an elevated app, run this app elevated too. You can stop a run with Stop.
ja_jp: 【重要】「実行」を押したあと、カウント中に入力したいウィンドウをクリックして前面にしてください。 開始まで: {0} 秒 このアプリが前面のままだと、ここへ入力されてしまいます。 管理者権限のアプリへ送る場合は、本アプリも管理者実行が必要です。 実行中は「中断」で止められます。

# Dialog_RunErrorTitle
source: Run error
ja_jp: 実行エラー

# Dialog_DefaultMessage
source: Press OK to continue to the next step.
ja_jp: OKを押すと次の手順へ進みます。

# Error_WaitNumeric
source: Wait time must be a number of seconds
ja_jp: 待機秒数は数値で入力してください

# Error_RepeatCount
source: Repeat count must be an integer from 1 to {0}
ja_jp: 繰り返し回数は 1〜{0} の整数で指定してください

# Error_HotkeyEmpty
source: Shortcut is empty
ja_jp: ショートカットが空です

# Error_ModifierDuplicate
source: Duplicate modifier: {0}
ja_jp: 修飾キーが重複しています: {0}

# Error_MainKeyOnce
source: Specify only one main key
ja_jp: メインキーは1つだけ指定してください

# Error_NeedMainKey
source: Include one key that is not a modifier
ja_jp: 修飾キー以外のキーを1つ含めてください

# Error_RepeatCountAtStep
source: Step {0}: repeat count must be an integer from 1 to {1}
ja_jp: 手順 {0}: 繰り返し回数は 1〜{1} の整数で指定してください

# Error_OrphanEndRepeat
source: Step {0}: End has no matching Repeat
ja_jp: 手順 {0}: 「ここまで」に対応する「繰り返し」がありません

# Error_UnclosedRepeat
source: {0} Repeat block(s) are unclosed (add End)
ja_jp: 「繰り返し」が {0} 個閉じられていません（「ここまで」を追加してください）

# Sample_LoginName
source: Login and type fixed data
ja_jp: ログイン&定型データ入力

# Sample_SelectCopyName
source: Select all and copy
ja_jp: 全選択＆コピー

# Sample_EnterX3Name
source: Enter 3 times
ja_jp: Enterを3回

# Sample_LoginDialog
source: Press OK after you confirm login succeeded
ja_jp: ログイン完了を確認したら OK を押してください

# Cli_Help
source: KeyAutomator — keyboard automation Usage: KeyAutomator.exe Start the GUI KeyAutomator.exe -1 Run ID=1 KeyAutomator.exe -id 1 Same KeyAutomator.exe -alias NAME Run by alias KeyAutomator.exe -NAME Same (short form) KeyAutomator.exe -name "Name" Run by display name KeyAutomator.exe -h Show this help Exit codes: 0 success / 1 failure Log: error.log (writable data folder; if the exe folder is protected, %LocalAppData%\KeyAutomator) Notes: - CLI runs the macro without the management window - Macros with a confirm (dialog) action still show a message box in CLI (this is not fully unattended)
ja_jp: KeyAutomator — キー入力自動化 使い方: KeyAutomator.exe GUI を起動 KeyAutomator.exe -1 ID=1 を実行 KeyAutomator.exe -id 1 同上 KeyAutomator.exe -alias NAME 引数名で実行 KeyAutomator.exe -NAME 同上（短縮） KeyAutomator.exe -name "表示名" 表示名で実行 KeyAutomator.exe -h このヘルプ 終了コード: 成功 0 / 失敗 1 ログ: error.log（書き込み可能なデータフォルダ。保護フォルダ時は %LocalAppData%\KeyAutomator） 注意: - CLI では管理画面を出さずにマクロを実行します - 確認アクション(dialog) があるマクロは、CLI でもメッセージボックスが出ます （完全な無人実行ではありません）

# Cli_MacroNotFound
source: Macro not found. Use -h for usage.
ja_jp: 指定マクロが見つかりません。-h で使い方を表示します。

# Log_Error
source: Error
ja_jp: エラー

# Log_OpenFolder
source: Open settings folder
ja_jp: 設定フォルダを開く

# Log_CopyLaunchPath
source: Copy launch path
ja_jp: 起動パスをコピー

# Log_DeleteMacro
source: Delete macro
ja_jp: マクロ削除

# Log_DeleteAction
source: Delete step
ja_jp: 手順削除

# Log_TestRun
source: Test run
ja_jp: テスト実行

# Log_GuiLoad
source: GUI load
ja_jp: GUI 読み込み

# Log_SaveFailed
source: Save failed
ja_jp: 保存失敗

# Log_SettingsLoadFailed
source: Failed to load settings.json
ja_jp: settings.json 読み込み失敗

# Log_SettingsSaveFailed
source: Failed to save settings.json
ja_jp: settings.json 保存失敗

# Log_CliMacroNotFound
source: Macro not found: {0}
ja_jp: 指定マクロが見つかりません: {0}

# Log_CliCancelled
source: CLI run was cancelled
ja_jp: CLI実行がキャンセルされました

# Log_CliError
source: CLI run error
ja_jp: CLI実行エラー

# Log_ConfigLoadFailed
source: Failed to load config.json
ja_jp: config.json 読み込み失敗

# Log_InvalidRepeatCount
source: Invalid repeat count: '{0}'
ja_jp: repeat の回数が不正です: '{0}'

# Log_MissingEndRepeat
source: No matching end_repeat for repeat (step {0})
ja_jp: repeat に対応する end_repeat がありません（手順 {0}）

# Log_OrphanEndRepeat
source: end_repeat without a matching repeat (step {0})
ja_jp: 対応する repeat のない end_repeat です（手順 {0}）

# Log_InvalidWait
source: Invalid wait value: '{0}'
ja_jp: wait の値が不正です: '{0}'

# Log_UnknownActionType
source: Unknown action type: {0}
ja_jp: 未知のアクション種別: {0}

# Log_UnknownKey
source: Unsupported key name: {0}
ja_jp: 未対応のキー名: {0}

# Log_InvalidHotkeyMain
source: Invalid hotkey main key: {0}
ja_jp: ホットキーのメインキーが不正: {0}

# Log_UnknownMouse
source: Unsupported mouse action: {0}
ja_jp: 未対応のマウス操作: {0}

# Log_SendInputFailed
source: SendInput failed (GetLastError={0})
ja_jp: SendInput 失敗 (GetLastError={0})

# Ex_ConfigUnreadable
source: Could not parse config.json
ja_jp: config.json の内容を解釈できませんでした

# Ex_ConfigNotCreated
source: File was not created at the save path: {0}
ja_jp: 保存先にファイルが作成されませんでした: {0}

# Ex_ConfigEmptyAfterSave
source: config.json was empty after save: {0}
ja_jp: 保存後の config.json が空です: {0}

# Ex_PathContainsQuote
source: Paths cannot contain double quotes.
ja_jp: パスにダブルクォートは含められません。
